In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.read_csv('expenses.csv')
df

          Date  Amount         Item Category  Split
0   2024-04-04      25       maggie     food      2
1   2024-04-05      60    mogu-mogu     food      2
2   2024-04-05      40        ocean     food      2
3   2024-04-05    1224    brindavan  utility      1
4   2024-04-05     117      flowers  utility      1
5   2024-04-05      27         curd  utility      1
6   2024-04-06      90  honeychilli     food      2
7   2024-04-06      60        ocean     food      2
8   2024-04-06     203   vegetables  utility      1
9   2024-04-06     180        pasta  utility      1
10  2024-04-07     166     tamarind  utility      1
11  2024-04-07      50      haircut  utility      1
12  2024-04-07     250       petrol  utility      2
13  2024-04-07     180   stationery  utility      1
14  2024-04-07      26         vada  utility      1
15  2025-04-08      25          tea     food      2
16  2024-04-08    1000      advance       me      3
17  2024-04-09     180         cake     food      2

categorical

In [2]:
d = df[["Category", "Amount"]].groupby("Category").sum()
d

          Amount
Category
food         480
me          1000
utility     2423

date wise

In [3]:
d = df[["Date", "Amount"]].groupby("Date").sum()
d

            Amount
Date
2024-04-04      25
2024-04-05    1468
2024-04-06     533
2024-04-07     672
2024-04-08    1000
2024-04-09     180
2025-04-08      25

owed

In [4]:
d = (df["Amount"] - (df["Amount"] / df["Split"])).sum()
d

1031.6666666666667